ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
/******************************************************************//**
* @file   stm32f4_discovery_wifi.c
* @brief  This file contains implementation of STM32F4 WIFI in custom method.
* @version  V1.0
* @date   May 29, 2015
* @author Bhavin Darji.Edutech learning solutions
**********************************************************************/

/* Includes ------------------------------------------------------------------- */
#include "stm32f4_discovery_wifi.h"
#include "stm32f4_discovery_uart.h"
#include <string.h>
/* Peripheral group ----------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_WIFI
 * @{
 */

/* Public Types --------------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_WIFI_Public_Types
 * @{
 */
uint8_t RxBuffer[RX_BUFFER_SIZE];
uint32_t RxBufferTail = 0;
uint32_t RxBufferHead = 0;

static uint8_t tempReTXBuf[SEND_BUF_SIZE];
int32_t tempReTXLen;

RX_Info_Typedef rx_frame[NUM_RX_BUF];

static Serial_RX_State_Typedef serial_rx_state;
static int32_t curr_buf_idx = 0;
static int32_t curr_read_idx = 0;
static int32_t rx_frm_payload_index;
static int32_t rx_frm_data_index;
static uint8_t rx_frm_chksum;

extern int32_t buf_pos;
extern uint8_t RxBuffer[];
extern int32_t ack_recv_status;
extern int8_t mysock;
extern int8_t sockConnected;
extern int8_t sockClosed;

uint16_t timeout = 10000;

uint8_t totalscan = 0;
Scanlist_Typedef sl[30];
int8_t SSID[20];
int32_t SSIDlen = 0;
uint8_t secMode = 0;
uint8_t APOnOff = 1;
int8_t secKey[64];
uint8_t Keylen = 0;

int32_t joinok = 0;
int32_t ipok = 0;
uint32_t selfIP = 0;
uint16_t pktcnt = 0;

int8_t domain[100];
int8_t Portstr[8]={0};
int8_t IPstr[32]={0};
int8_t out[256];

uint8_t DBGU_InputReady = 0;
uint8_t quit_flag = 0;

uint8_t key;
uint8_t seqNo = 0;

int8_t mysock = -1;
uint8_t TxBuf[TEST_BUFFERSIZE];
int8_t uri[100]={0};
int8_t sockConnected = -1;
int8_t sockClosed = -1;
int32_t timeout1 = 5;

#define HTTP_RSP_STR "HTTP/1.1 200 OK\r\n" \
    "Content-Type: text/html\r\n" \
    "Connection: close\r\n" \
    "Content-Length: 47\r\n\r\n" \
    "<html><body>Hello from SN8200 #%2d</body></html>\r\n\r\n"

#define GET_REQUEST \
    "GET / HTTP/1.1\r\n" \
    "Host: 192.168.2.125\r\n" \
    "Accept: text/html\r\n" \
    "\r\n"

uint8_t IsWIFIGetStatusResponsed = 0;
uint8_t IsWIFIJoinResponsed = 0;
uint8_t IsWIFIApCtrlResponsed = 0;

uint8_t IsSNICIPConfigResponsed = 0;
uint8_t IsSNICGetDHCPInfoResponsed = 0;
uint8_t IsSNICTCPConnectToServerResponsed = 0;
uint8_t IsSNICSendFromSocketResponsed = 0;
uint8_t IsSNICUDPSendFromSocketResponsed = 0;
uint8_t IsCreateSocketResponsed = 0;

int32_t destIP = INADDR_NONE;
int32_t srcIP = INADDR_NONE;
int32_t destPort = PORT_NONE;
int32_t srcPort = PORT_NONE;

int32_t udpDestIP = INADDR_NONE;
int32_t udpSrcIP = INADDR_NONE;
int32_t udpDestPort = PORT_NONE;
int32_t udpSrcPort = PORT_NONE;

volatile uint8_t sendUDPDone = 0;
extern uint8_t seqNo;

UART_HandleTypeDef huart1;

/**
 * @} STM32F4_DISCOVERY_WIFI_Public_Types End
 */

/* Private Functions ----------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_WIFI_Private_Functions
 * @{
 */

/**
 * @brief Data to be sent to Discover-WIFI
 * @param buf buffer
 * @param len buffer length
 */
static void SN8200_HAL_SendData(uint8_t *buf, int16_t len)
{
  int32_t i;

  for (i = 0; i < len; i++)
  {
    HAL_UART_Transmit(&huart1, &buf[i],1,10000);
    while (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_TC) == RESET);
  }
}


/**
 * @brief Check RX buffer
 * @return  value
 */
static uint8_t SN8200_HAL_RxBufferEmpty(void)
{
  return (RxBufferHead == RxBufferTail);
}

/**
 * @brief Read data from Received buffer
 * @return Received data
 */
static int32_t SN8200_HAL_ReadByte(void)
{
  uint8_t data = 0;

  if(RxBufferHead != RxBufferTail)
  {
    data = RxBuffer[RxBufferTail];
    RxBufferTail = (RxBufferTail + 1) % RX_BUFFER_SIZE;
  }

  return data;
}

/**
 * @brief initialize UART1 for Discover-WIFI
 * @param huart uart handle
 *        @arg huart1
 */
static void BSP_WIFI_MspInit(UART_HandleTypeDef* huart)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  if(huart->Instance==USART1)
  {
    /* Peripheral clock enable */
    __USART1_CLK_ENABLE();
    __GPIOB_CLK_ENABLE();
    /**USART1 GPIO Configuration
    PB6     ------> USART1_TX
    PB7     ------> USART1_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Peripheral interrupt init*/
    HAL_NVIC_SetPriority(USART1_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USART1_IRQn);
  }
}

/**
 * @brief Tx buffer
 * @param c data to be transmitted
 * @return data
 */
static uint8_t Dummy_TX(uint8_t c)
{
  tempReTXBuf[tempReTXLen++] = c;
  if (c == EOM_CHAR || tempReTXLen >= SEND_BUF_SIZE)
  {
    SN8200_HAL_SendData(tempReTXBuf, tempReTXLen);
    memset(tempReTXBuf, 0, tempReTXLen);
    tempReTXLen = 0;
  }
  return c;
}

/**
 * @brief transmit payload without using ESC
 * @param payload_len length of payload
 * @param payload data
 * @return value
 */
static uint8_t Escape_Payload_And_Transmit_NoESC(int16_t payload_len, uint8_t *payload)
{
  int32_t i;
  uint8_t chksum=0;
  uint8_t tx;
  for (i=0; i<payload_len; ++i)
  {
    tx = *payload++;
    if (tx != SOM_CHAR && tx != EOM_CHAR && tx != ESC_CHAR)
    {
      SERIAL_TX(tx);
      chksum += tx;
    }
    else
    {
      SERIAL_TX(ESC_CHAR);
      SERIAL_TX(0x80|tx);
      chksum += ESC_CHAR;
      chksum += (0x80|tx);
    }
  }
  return chksum;
}
/**
 * @brief length of data to be transmitted
 * @param payload_len
 * @param payload
 * @return length of data
 */
static int16_t Calc_Escaped_Payload_Len_NoESC(int16_t payload_len, uint8_t *payload)
{
  int32_t i;
  int32_t len=0;
  uint8_t c;

  for (i=0; i<payload_len; ++i)
  {
    c = *payload++;
    if (c == SOM_CHAR || c == EOM_CHAR || c == ESC_CHAR)
    {
      len += 2;
    }
    else
    {
      len ++;
    }
  }
  return len;
}

/**
 * @brief Transmit data frame
 * @param cmd_id SN8200 command id
 * @param payload_len  length of data
 * @param payload data
 * @param ack_required ack yes or no
 * @param len calculated length of payload
 * @return value
 */
static int8_t NoESC_Transmit(uint8_t cmd_id, int16_t payload_len, uint8_t *payload, uint8_t ack_required, int16_t len)
{
  uint8_t cksum=0;
  uint8_t hdr = 0x80;
  timeout = 10000;
  SERIAL_TX(SOM_CHAR); // Send SOM character
  SERIAL_TX(0x80|len); // Send payload len
  cksum += (0x80|len);
  hdr |= (ack_required<<6);
  if (len > 0x7f)
  {
      hdr |= (len>>7);
  }
  cksum += (0x80 | hdr);
  SERIAL_TX(0x80|hdr); // ACK, SEQ and frag number
  SERIAL_TX(0x80|cmd_id); // ACK, SEQ and frag number
  cksum += (0x80 | cmd_id);
  cksum += Escape_Payload_And_Transmit_NoESC(payload_len, payload);
  cksum |= 0x80;
  SERIAL_TX(cksum); // checksum
  SERIAL_TX(EOM_CHAR); // Send EOM character
  return 0;
}

/**
 * @brief Process the received data
 * @param rx_ch data
 * @return value
 */
static int32_t RX_Process_Char_NoESC(uint8_t rx_ch)
{
    int32_t ch=-1;
    switch(serial_rx_state)
    {
      case IDLE:
        if (rx_ch == SOM_CHAR)
        {
rx_process_char_no_ESC_RX_SOM:
          serial_rx_state = SOM_RECD;
          rx_frm_payload_index = 0;
          rx_frm_chksum = 0;
          rx_frm_data_index = 0;
        }
        else
            ch = rx_ch;
        break;

      case SOM_RECD:
        if( (rx_ch & 0x80) == 0 )
        {
          goto rx_process_char_no_ESC_err;
        }
        serial_rx_state=LEN_RECD;
        rx_frame[curr_buf_idx].payload_len = rx_ch & 0x7F;
        rx_frm_chksum += rx_ch;
        break;

      case LEN_RECD:
        if( (rx_ch & 0x80) == 0 )
        {
          goto rx_process_char_no_ESC_err;
        }
        serial_rx_state=ACK_SEQ_RECD;
        rx_frame[curr_buf_idx].payload_len |= (rx_ch & 0x3f)<<7;
        rx_frame[curr_buf_idx].ack_reqd = (rx_ch >> 6) & 0x01;
        rx_frm_chksum += rx_ch;
        break;

