ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
      case ACK_SEQ_RECD:
        if( (rx_ch & 0x80) == 0 )
        {
          goto rx_process_char_no_ESC_err;
        }
        serial_rx_state=CMD_RECD;
        rx_frame[curr_buf_idx].cmd_id = rx_ch & 0x7F;
        rx_frm_chksum += rx_ch;
        break;

      case CMD_RECD:
        serial_rx_state=PAYLAD_RX;

      case PAYLAD_RX:
        rx_frm_payload_index++;
        if (rx_ch == SOM_CHAR)
        {
          goto rx_process_char_no_ESC_err;
        }
        else if (rx_ch == EOM_CHAR)
        {
          serial_rx_state = IDLE;
        }
        else if (rx_ch == ESC_CHAR)
        {
          serial_rx_state = PAYLAD_RX_ESC;
          rx_frm_chksum += rx_ch;
        }
        else if (rx_frm_payload_index > rx_frame[curr_buf_idx].payload_len)
        {
          serial_rx_state = CHKSUM_RECD;
           rx_frame[curr_buf_idx].chksum = rx_ch;
        }
        else
        {
          rx_frm_chksum += rx_ch;
          rx_frame[curr_buf_idx].rx_payload[rx_frm_data_index++] = rx_ch;
        }
        break;

      case PAYLAD_RX_ESC:
        rx_frm_payload_index++;
        if (rx_ch > 127)
        {
          rx_frm_chksum += rx_ch;
          rx_frame[curr_buf_idx].rx_payload[rx_frm_data_index++] = rx_ch&0x7F;
          serial_rx_state = PAYLAD_RX;
        }
        else
        {
          goto rx_process_char_no_ESC_err;
        }
        break;

      case CHKSUM_RECD:
        if (rx_ch != EOM_CHAR);
        else if( (rx_frame[curr_buf_idx].chksum & 0x7F) == (rx_frm_chksum & 0x07F))
        { //checksum match
          rx_frame[curr_buf_idx].payload_len = rx_frm_data_index;
          rx_frame[curr_buf_idx].ackOk = 1;
          rx_frame[curr_buf_idx].available = 1;
          curr_buf_idx = (curr_buf_idx +1) % NUM_RX_BUF;
          serial_rx_state = IDLE;
        }
        else
        {
          //rx_bad_frame();
        }
        serial_rx_state = IDLE;
        break;

      default:
rx_process_char_no_ESC_err:
        serial_rx_state = IDLE;
        if( rx_ch == SOM_CHAR )
        {
          goto rx_process_char_no_ESC_RX_SOM;
        }
        break;
    }
    if (ch != -1)
    {
      return ch;
    }
    else
        return -1;
}
/**
 * @brief WIFI RX handle
 * @param buf data buffer
 * @param len length of data
 */
static void handleRxWiFi(uint8_t* buf, int16_t len)
{
  uint8_t subCmdId = buf[0];
  switch (subCmdId)
  {
    case WIFI_GET_STATUS_RSP:
      IsWIFIGetStatusResponsed = 1;
      if (buf[2] == MODE_WIFI_OFF)
      {
        uprintf("WiFi Off.\n\r");
      }
      else
      {
        int8_t val[20] = {0};
        int32_t i=0;
        for(i=0; i<6; i++)
        {
          sprintf(val+3*i, "%02X:", buf[3+i]);
        }
        val[strlen(val)-1] = 0;
        uprintf("WiFi On.  Mac: %s.  ", val);
        if (buf[2] == MODE_NO_NETWORK)
        {
          uprintf("Not joined any network.\n\r");
        }
        else
        {
          uprintf("Joined SSID: %s\n\r", buf+9);
        }
      }
      break;

    case WIFI_JOIN_RSP:
      IsWIFIJoinResponsed = 1;
      if (WIFI_SUCCESS == buf[2])
      {
        uprintf("Join success\n\r");
      }
      else
      {
        uprintf("Join fail\n\r");
      }
      break;

    case WIFI_AP_CTRL_RSP:
      IsWIFIApCtrlResponsed = 1;
      if (WIFI_SUCCESS == buf[2])
      {
        if (APOnOff)
        {
          uprintf("AP is ON\n\r");
        }
        else
        {
          uprintf("AP is OFF\n\r");
        }
      }
      else
      {
        uprintf("AP control fail\n\r");
      }
      break;

    case WIFI_NETWORK_STATUS_IND:
      if (WIFI_NETWORK_UP == buf[3])
      {
        uprintf("Network UP\n\r");
        joinok = 1;
      }
      else
      {
        uprintf("Network Down\n\r");
      }
      break;

    case WIFI_SCAN_RESULT_IND:
    {
      int8_t cnt = buf[2];
      uint8_t i=3;
      uint8_t j;
      uint8_t ch, sec_tmp;
      uint8_t rssi;
      uint8_t len=32;
      if(cnt == 0)
      {
        for (j = 0; j < totalscan; j++)
        {
          uprintf("SSID: %s CH: %d02 RSSI: %d03 Sec: %d02 \n\r",sl[j].SSIDname, sl[j].ch,sl[j].rssi,sl[j].sectype);
        }
        memset(sl, 0, totalscan * sizeof(Scanlist_Typedef));
        totalscan = 0; //reset current scan result
      }
      else
      {
        while (cnt--)
        {
          ch = buf[i++];
          rssi = (uint8_t)buf[i++];
          sec_tmp = buf[i++];
          i += 6;
          i++;
          i += 2;
          len = (uint8_t)strlen((int8_t*)buf+i);
          if (len>32)
          {
            break;
          }
          strcpy((int8_t*)sl[totalscan].SSIDname,(int8_t*)buf+i);
          sl[totalscan].ch = ch;
          sl[totalscan].rssi = rssi;
          sl[totalscan].sectype = sec_tmp;
          if (len == 0)
          {
            while (buf[i] == 0) i++;
          }
          else
          {
            i += len+1;
          }
          totalscan++;
        }
      }
      break;
    }
    default:
      break;
  }
  uprintf(".\n\r");
}

/**
 * @brief SNIC RX handle
 * @param buf data buffer
 * @param len length of data
 */
static void handleRxSNIC(uint8_t* buf, int32_t len)
{
  uint8_t subCmdId = buf[0];
  static int32_t times = 0;
  static int32_t isPrintable = 0;

  switch (subCmdId)
  {
    case SNIC_CLOSE_SOCKET_RSP:
      if (SNIC_SUCCESS != buf[2])
      {
        uprintf("Close socket failed\n\r");
      }
      else
      {
        uprintf("Socket closed\n\r");
      }
      break;

    case SNIC_IP_CONFIG_RSP:
      IsSNICIPConfigResponsed = 1;
      ipok = 0;
      if (SNIC_SUCCESS == buf[2])
      {
        uprintf("IPConfig OK\n\r");
        ipok = 1;
      }
      else
      {
        uprintf("IPConfig fail\n\r");
      }
      break;

    case SNIC_GET_DHCP_INFO_RSP:
      IsSNICGetDHCPInfoResponsed = 1;
      if (SNIC_SUCCESS == buf[2])
      {
        uprintf("IP assigned as %d03.%d03.%d03.%d03 \n\r", buf[9],buf[10],buf[11],buf[12]);
          //save IP
        memcpy(&selfIP, buf+9, 4);
      }
      else
      {
        uprintf("IP not assigned\n\r");
      }
      break;

    case SNIC_TCP_CREATE_SOCKET_RSP:

    case SNIC_TCP_CREATE_ADV_TLS_SOCKET_RSP:

    case SNIC_TCP_CREATE_SIMPLE_TLS_SOCKET_RSP:

    case SNIC_UDP_CREATE_SOCKET_RSP:
      IsCreateSocketResponsed = 1;
      if (SNIC_SUCCESS == buf[2])
      {
        mysock = buf[3];
        uprintf("Socket:%d02 opened\n\r", mysock);
      }
      else
      {
        uprintf("Socket creation failed\n\r");
      }
      break;

    case SNIC_TCP_CONNECT_TO_SERVER_RSP:
      IsSNICTCPConnectToServerResponsed = 1;
      if (SNIC_CONNECT_TO_SERVER_PENDING == buf[2] || SNIC_SUCCESS == buf[2]);
      else
      {
        uprintf("Unable to connect server\n\r");
      }
      break;

