ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
    case SNIC_TCP_CREATE_CONNECTION_RSP:
      if (SNIC_SUCCESS != buf[2])
      {
        uprintf("Unable to create TCP server\n\r");
      }
      break;

    case SNIC_TCP_CONNECTION_STATUS_IND:
      if (SNIC_CONNECTION_UP == buf[2])
      {
        uprintf("Socket connection UP\n\r");
        sockConnected = buf[3];
      }
      else if (SNIC_CONNECTION_CLOSED == buf[2])
      {
        uprintf("Socket %d02 closed\n\r", buf[3]);
        sockClosed = buf[3];
      }
      break;

    case SNIC_SEND_RSP:
    {
      uint32_t sentsize;
      IsSNICSendFromSocketResponsed = 1;
      if (SNIC_SUCCESS == buf[2])
      {
        pktcnt ++;
        sentsize = ((uint32_t)(buf[3] << 8) | (uint32_t)buf[4]);
        uprintf("pkt %d03, %d03 bytes sent \n\r", pktcnt, sentsize);
      }
      break;
    }
    case SNIC_CONNECTION_RECV_IND:
    {
      int32_t i=0;
      uint32_t sentsize = ((uint32_t)(buf[3] << 8) | (uint32_t)buf[4]);
      uint32_t sock = (uint32_t)buf[2];
      uprintf("%d03 bytes received from socket %d02 \n\r", sentsize, sock);
      HAL_Delay(10);
      if (strncmp((int8_t*)buf+5, "GET /", 5) == 0 || strncmp((int8_t*)buf+5, "POST /", 6) == 0)  // Receives a HTTP(S) get/post request.
      {
        static int32_t i=0;
        for (i=0; i<sentsize; i++)
        {
          uprintf("%c", buf[5+i]);
        }
        i = 0;
        sprintf(out, HTTP_RSP_STR, i++);
        // Send back something
        SendFromSock(sock, (uint8_t*)out, strlen(out), 2, seqNo++);

        // If it is a TLS server, it only accepts one connection, so
        // it is better for the host app to close it after some idle time for new connections.
        //  Sleep(100);
        //  closeSocket((int8u)sock,seqNo++);
      }
      else if (strncmp((int8_t*)buf+5, "HTTP/1.", 7) == 0)  // Receives HTTP response, close socket. If the socket is not closed,
      {
        for (i=0; i<sentsize; i++)
        {
          uprintf("%c", buf[5+i]);
        }                                              // it can be used for more data communication (using send from socket).
        CloseSocket((uint8_t)sock,seqNo++); }
      break;
    }
    case SNIC_TCP_CLIENT_SOCKET_IND:
    {
       uint8_t listen_sock = buf[2];
       uprintf("Accepted connection from %d03.%d03.%d03.%d03\n\r", buf[4], buf[5], buf[6], buf[7]);
       uprintf("Connection socket: %d02\n\r", buf[3]);
       break;
    }
    case SNIC_UDP_RECV_IND:
       uprintf("%d02 %d04\n\r", times++, htons(*((uint16_t *)&buf[9])));
       break;

    case SNIC_UDP_SEND_FROM_SOCKET_RSP:
       IsSNICUDPSendFromSocketResponsed = 1;
       if (SNIC_SUCCESS != buf[2])
       {
         uprintf("UDP Send bad\n\r");
       }
       sendUDPDone = 1;
       break;
    case SNIC_HTTP_REQ|0x80:

    case SNIC_HTTPS_REQ|0x80:

    case SNIC_HTTP_MORE_REQ|0x80:
    {
      int8_t *contentT = "";
      uint16_t len = *((int32_t*)&buf[4]);
      int32_t contTLen = 0;
      uint32_t moreData = len & 0x8000;
      int8_t more[10] = {0};
      uint8_t seq = buf[1];
      int32_t status = *((int32_t*)&buf[2]);
      status = swap16(status);
      len = swap16(len);
      if (subCmdId == (SNIC_HTTP_MORE_REQ|0x80))
      {
        strcpy(more, "more ");
      }
      len &= 0x7fff;
      if (status >= 100)
      {
        contentT = (int8_t*)&buf[6];;
        contTLen = strlen(contentT)+1;
      }
      if (status < 100)
      {
        uprintf("\nHTTP %sRSP code: %d02, seq#: %d02\n\r", more, status, seq);
        break;
      }
      uprintf("\nHTTP %sRSP code: %d06 , seq#: %d02 , Content Length: %d03 , Type: %s , More data: %s\n\r", more,
          status, seq, len, contentT, moreData?"yes":"no");
      isPrintable = 0;
      if (contTLen && (strstr(contentT, "text") || strstr(contentT, "xml") ||
          strstr(contentT, "javascript") || strstr(contentT, "html") ||
          strstr(contentT, "json")))
      {
        isPrintable = 1;
        buf[6+contTLen+len] = 0;
        uprintf("Content: \n%s\n\r", buf+6+contTLen);
      }
      break;
    }
    case SNIC_HTTP_RSP_IND:
    {
      uint8_t seq = buf[1];
      uint32_t moreData;
      len = *((int32_t*)&buf[2]);
      len = swap16(len);
      moreData = len & 0x8000;
      len &= 0x7fff;
      uprintf("\nHTTP RSP indication, seq#: %d06, content length: %d03, More data: %s\n\r", seq, len, moreData?"yes":"no");
      if (isPrintable)
      {
        buf[4+len] = 0;
        uprintf("Content: \n%s\n\r", buf+4);
      }
      break;
    }
    default:
      break;
  }
  uprintf(".\n\r");
}


/**
 * @brief Serial command protocol
 * @param commandId select the mode
 * @param paramLength data length
 * @param params data
 * @return value
 */
static uint8_t Sci_Ser_Cmd_Proc(int16_t commandId, int16_t paramLength, uint8_t *params)
{
    switch (commandId)
    {
      case CMD_ID_WIFI:
        handleRxWiFi(params,paramLength);
        break;

      case CMD_ID_SNIC:
        handleRxSNIC(params,paramLength);
        break;

      default:
        break;
    }
    return 0;
}
/**
 * @brief check receive frame
 * @return value
 */
static uint8_t SN8200_RxFrameEmpty(void)
{
    return (curr_read_idx == curr_buf_idx);
}

/**
 * @brief process received frame
 * @param idx provide the command id for received frame
 * @return
 */
static int8_t Process_RX_Frame(int32_t idx)
{
    if (rx_frame[idx].cmd_id == 0x7F)
    {
      //serial_ack_nak_recd(1);
    }
    else if (rx_frame[idx].cmd_id == 0x00)
    {
      //serial_ack_nak_recd(0);
    }
    else
    {
      if (rx_frame[idx].ack_reqd)
      {
        //send_ack_nak(rx_frame[idx].ackOk);
      }
      if (rx_frame[idx].ackOk)
      {
        Sci_Ser_Cmd_Proc(rx_frame[idx].cmd_id, rx_frame[idx].payload_len, rx_frame[idx].rx_payload);
      }
    }
    return 0;
}

/**
 * @brief serial data transmit using UART
 * @param cmd_id provide command id
 * @param payload data
 * @param payload_len data length
 * @param ack_required acknowledgment
 * @return value
 */
static int32_t Serial_Transmit(uint8_t cmd_id, uint8_t *payload, int16_t payload_len, uint8_t ack_required)
{
    int16_t len;

    if(payload_len > MAX_PAYLOAD_LEN)
        return 0;

    len = Calc_Escaped_Payload_Len_NoESC(payload_len, payload);
    return NoESC_Transmit(cmd_id, payload_len, payload, ack_required, len);
}

/**
 * @brief RX thread process it will first put received data from buffer to RX frame then process the RX frame
 */
static void RX_Thread_Proc(void)
{
    uint8_t data;

    while(!SN8200_HAL_RxBufferEmpty())
    {
      data = SN8200_HAL_ReadByte();
      RX_Process_Char_NoESC(data);
    }

    while(!SN8200_RxFrameEmpty())
    {
      if (rx_frame[curr_read_idx].available)
      {
        Process_RX_Frame(curr_read_idx);
        rx_frame[curr_read_idx].available = 0;
      }
      curr_read_idx = (curr_read_idx+1) % NUM_RX_BUF;
    }
}


/**
 * @brief Check whether "cp" is a valid ascii representation of an
 *        Internet address and convert to a binary address
 * @param cp IP address in ascii represenation (e.g. "127.0.0.1")
 * @param addr pointer to which to save the ip address in network order
 * @return 1 if cp could be converted to addr, 0 on failure
 */
static int8_t inet_aton(const int8_t *cp, struct in_addr *addr)
{
  uint32_t val;
  uint8_t base;
  int8_t c;
  int32_t parts[4];
  int32_t *pp = parts;

  c = *cp;
  for (;;)
  {
    /*
     * Collect number up to ``.''.
     * Values are specified as for C:
     * 0x=hex, 0=octal, 1-9=decimal.
     */
    if (!isdigit(c))
    {
      return (0);
    }
    val = 0;
    base = 10;
    if (c == '0')
    {
      c = *++cp;
      if (c == 'x' || c == 'X')
      {
        base = 16;
        c = *++cp;
      }
      else
      {
        base = 8;
      }
    }
    for (;;)
    {
      if (isdigit(c))
      {
        val = (val * base) + (int32_t)(c - '0');
        c = *++cp;
      }
      else if (base == 16 && isxdigit(c))
      {
        val = (val << 4) | (int32_t)(c + 10 - (islower(c) ? 'a' : 'A'));
        c = *++cp;
      }
      else
      {
        break;
      }
    }
    if (c == '.')
    {
      /*
       * Internet format:
       *  a.b.c.d
       *  a.b.c   (with c treated as 16 bits)
       *  a.b (with b treated as 24 bits)
       */
      if (pp >= parts + 3)
      {
        return (0);
      }
      *pp++ = val;
      c = *++cp;
    }
    else
    {
      break;
    }
  }

