ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
  /*
   * Check for trailing characters.
   */
  if (c != '\0' && !isspace(c))
  {
    return (0);
  }
  /*
   * Concoct the address according to
   * the number of parts specified.
   */
  switch (pp - parts + 1)
  {
    case 0:
      return (0);       /* initial nondigit */

    case 1:             /* a -- 32 bits */
      break;

    case 2:             /* a.b -- 8.24 bits */
      if (val > 0xffffffUL)
      {
        return (0);
      }
      val |= parts[0] << 24;
      break;

    case 3:             /* a.b.c -- 8.8.16 bits */
      if (val > 0xffff)
      {
        return (0);
      }
      val |= (parts[0] << 24) | (parts[1] << 16);
      break;

    case 4:             /* a.b.c.d -- 8.8.8.8 bits */
      if (val > 0xff)
      {
        return (0);
      }
      val |= (parts[0] << 24) | (parts[1] << 16) | (parts[2] << 8);
      break;
  }
  if (addr)
  {
    addr->s_addr = htonl(val);
  }
  return (1);
}

/**
 * @brief Internet address
 * @param cp Valid ascii representation of an Internet address
 * @return value
 */
static uint32_t inet_addr(const int8_t *cp)
{
  struct in_addr val;

  if (inet_aton(cp, &val))
  {
    return (val.s_addr);
  }
  return (INADDR_NONE);
}

/**
 * @} STM32F4_DISCOVERY_WIFI_Private_Functions End
 */


/* Public Functions ----------------------------------------------------------- */
/** @addtogroup STM32F4_DISCOVERY_WIFI_Public_Functions
 * @{
 */

/**
 * @brief initialize UART interface for Discover-WIFI
 * @param baudrate provide Baudrate value communicate (115200)
 */
void SN8200_HAL_Init(uint32_t baudrate)
{
  huart1.Instance = USART1;
  huart1.Init.BaudRate = baudrate;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;

  BSP_WIFI_MspInit(&huart1);
  HAL_UART_Init(&huart1);

  __HAL_UART_ENABLE_IT(&huart1,UART_IT_RXNE);
}

/**
 * @brief This is UART1 receive function
 * @param huart uart handle
 *        @arg huart1
 * @return Received data
 */
uint16_t UART_ReceiveData(UART_HandleTypeDef* huart)
{
  /* Receive Data */
  return (uint16_t)(huart1.Instance->DR & (uint16_t)0x01FF);
}

/**
 * @brief Get TCP info
 * @return value
 */
int8_t GetTCPInfo(void)
{
  int8_t tempIPstr[32];
  int8_t teststr[8];

  if (strlen(IPstr)==0)
  {
    strcpy(IPstr, "192.168.10.101");
  }
  if (strlen(Portstr)==0)
  {
    strcpy(Portstr, "0x6990");
  }
  uprintf("Enter server IP to connect: \n\r");
  uget_line(tempIPstr,sizeof(tempIPstr));
//    scanf("%s", tempIPstr);
  uprintf("\n\r");
  if (strlen(tempIPstr))
  {
    strcpy(IPstr, tempIPstr);
  }
  destIP = inet_addr(IPstr);
  if (destIP == INADDR_NONE || destIP == INADDR_ANY)
  {
    return CMD_ERROR;
  }
  uprintf("Enter server port number: \n\r");
  uget_line(teststr,sizeof(teststr));
//    scanf("%s", teststr);
  uprintf("\n\r");
  if (strlen(teststr))
  {
    strcpy(Portstr, teststr);
  }
  destPort = strtol(Portstr, NULL, 0);
  destPort = swap16(destPort);
  if (destPort > 0xFFFF)
  {
    printf("Invalid port, max limit 0xFFFF \n\r");
    return CMD_ERROR;
  }
  return 0;
}

/**
 * @brief Set TCP info
 * @return value
 */
int8_t SetTCPInfo(void)
{
  int8_t teststr[8];
  if (selfIP == 0)
  {
    uprintf("IP address has not been obtained.\n\r");
    return CMD_ERROR;
  }
  srcIP = selfIP;

  uprintf("Enter server port number to set: \n\r");
  uget_line(teststr,sizeof(teststr));
//  scanf("%s", teststr);
  uprintf("\n\r");
  srcPort = strtol(teststr, NULL, 0);
  srcPort = swap16(srcPort);
  if (srcPort > 0xFFFF)
  {
    uprintf("Invalid port, max limit 0xFFFF \n\r");
    return CMD_ERROR;
  }
  return 0;
}

/**
 * @brief Get UDP info
 * @return value
 */
int8_t GetUDPInfo(void)
{
  int8_t tempIPstr[32];
  int8_t teststr[8];
  uprintf("Enter server IP to connect: \n\r");
  uget_line(tempIPstr,sizeof(tempIPstr));
//  scanf("%s", tempIPstr);
  uprintf("\n\r");
  udpDestIP = inet_addr(tempIPstr);
  if (udpDestIP == INADDR_NONE)
  {
    return CMD_ERROR;
  }
  uprintf("Enter server port number: \n\r");
  uget_line(teststr,sizeof(teststr));
//  scanf("%s", teststr);
  uprintf("\n\r");
  udpDestPort = strtol(teststr, NULL, 0);
  udpDestPort = swap16(udpDestPort);
  if (udpDestPort > 0xFFFF)
  {
    uprintf("Invalid port, max limit 0xFFFF \n\r");
    return CMD_ERROR;
  }
  return 0;
}

/**
 * @brief Set UDP info
 * @return value
 */
int8_t SetUDPInfo(void)
{
  int8_t teststr[8];
  if (selfIP == 0)
  {
    printf("IP address has not been obtained.\n\r");
    return CMD_ERROR;
  }
  udpSrcIP = selfIP;
  uprintf("Enter server port number to set: \n\r");
  uget_line(teststr,sizeof(teststr));
//  scanf("%s", teststr);
  uprintf("\n\r");
  udpSrcPort = strtol(teststr, NULL, 0);
  udpSrcPort = swap16(udpSrcPort);
  if (udpSrcPort > 0xFFFF)
  {
    printf("Invalid port, max limit 0xFFFF \n\r");
    return CMD_ERROR;
  }
  return 0;
}

/**
 * @brief check receive buffer
 * @return value
 */
int8_t SN8200_API_HasInput(void)
{
    return !SN8200_HAL_RxBufferEmpty();
}

/**
 * @brief Status of Discover-WIFI
 * @param seq sequence number
 */
void GetStatus(uint8_t seq)
{
  timeout = 10000;
  uint8_t buf[4];
  buf[0] = WIFI_GET_STATUS_REQ;
  buf[1] = seq;
  buf[2] = 0;
  Serial_Transmit(CMD_ID_WIFI, buf, 3, ACK_NOT_REQUIRED);
  uprintf("-GetStatus\n\r");
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsWIFIGetStatusResponsed)
    {
      IsWIFIGetStatusResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
}

/**
 * @brief Turn WIFI on
 * @param seq sequence number
 */
void WifiOn(uint8_t seq)
{
  uint8_t flag = 1;
  uint8_t buf[4];
  buf[0] = WIFI_ON_REQ;
  buf[1] = seq;
  buf[2] = (int8_t)'U';
  buf[3] = (int8_t)'S';
  Serial_Transmit(CMD_ID_WIFI, buf, 4, ACK_NOT_REQUIRED);
  uprintf("-WifiOn\n\r");
  HAL_Delay(1);
}

/**
 * @brief Turn WIFI off
 * @param seq sequence number
 */
void WifiOff(uint8_t seq)
{
  uint8_t buf[2];
  buf[0] = WIFI_OFF_REQ;
  buf[1] = seq;
  Serial_Transmit(CMD_ID_WIFI, buf, 2, ACK_NOT_REQUIRED);
  uprintf("-WifiOff\n\r");
}

/**
 * @brief turn Access point on
 * @param seq sequence number
 */
void ApOnOff(uint8_t seq)
{
  uint8_t buf[4];

  APOnOff ^= 1;
  buf[0] = WIFI_AP_CTRL_REQ;
  buf[1] = seq;
  buf[2] = APOnOff;
  buf[3] = 0; //persistency hardcode set as 0 means NOT save to NVM
  Serial_Transmit(CMD_ID_WIFI, buf, 4, ACK_NOT_REQUIRED);
  uprintf("-AP status\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsWIFIApCtrlResponsed)
    {
      IsWIFIApCtrlResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
}

/**
 * @brief check for other network
 * @param seq sequence number
 */
void WifiScan(uint8_t seq)
{
  uint8_t buf[12];
  buf[0] = WIFI_SCAN_REQ;
  buf[1] = seq;
  memset(&buf[2], 0, 10);
  buf[3] = 2; // bss type = any
  Serial_Transmit(CMD_ID_WIFI, buf, 12, ACK_NOT_REQUIRED);
  uprintf("-WifiScan\n\r");
}

/**
 * @brief Join the WIFI network
 * @param seq sequence number
 */
void WifiJoin(uint8_t seq)
{

  uint8_t buf[128];
  int8_t tempstr[2] = {0};
  uint8_t *p = buf;

  *p++ = WIFI_JOIN_REQ;
  *p++ = seq;

  uprintf("Enter SSID: \n\r");
  uget_line(SSID,sizeof(SSID));
//  uint8_t data,i;
//  i = 0;
//  while(1)
//  {
//    if(HAL_UART_Receive(&huart6,&data,1,50000) == HAL_OK)
//    {
//      if(data == In_CR)
//      {
//        break;
//      }
//      SSID[i] = data;
//      i++;
//      HAL_UART_Transmit(&huart6,&data,1,1000);
//    }
//  }

//  scanf("%s", SSID);
  uprintf("\n\r");
  while(!strlen(SSID))
  {
    uprintf("SSID can't be empty. Enter SSID: \n\r");
    uget_line(SSID,sizeof(SSID));
//      scanf("%s", SSID);
    uprintf("\n\r");
  }
  memcpy(p, SSID, strlen(SSID));
  p += strlen(SSID);
  *p++ = 0x00;
  uprintf("Enter Security Mode (e.g., 0 for open, 2 for WPA TKIP, 4 for WPA2 AES, 6 for WPA2 MIXED):\n\r");
  uget_line(tempstr,sizeof(tempstr));
//  scanf("%s", tempstr);
  uprintf("\n\r");
  secMode = atoi(tempstr);
  if (secMode)
  {
    uprintf("Enter Security Key:\n\r");
    uget_line(secKey,sizeof(secKey));
//    scanf("%s", secKey);
    uprintf("\n\r");
    Keylen = (uint8_t)strlen(secKey);
    if (Keylen <= 0)
    {
      uprintf("Invalid Key\n\r");
      return;
    }
  }
  *p++ = secMode;
  *p++ = Keylen;
  if (Keylen)
  {
    memcpy(p, secKey, Keylen);
    p += Keylen;
  }
  Serial_Transmit(CMD_ID_WIFI, buf, (int32_t)(p - buf), ACK_NOT_REQUIRED);
  uprintf("-WifiJoin\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsWIFIJoinResponsed)
    {
      IsWIFIJoinResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
  joinok = 0;
}

/**
 * @brief Disconnect the WIFI network
 * @param seq sequence number
 */
void WifiDisconn(uint8_t seq)
{
  uint8_t buf[2];
  buf[0] = WIFI_DISCONNECT_REQ;
  buf[1] = seq;
  Serial_Transmit(CMD_ID_WIFI, buf, 2, ACK_NOT_REQUIRED);
  uprintf("-WifiDisconn\n\r");
}

/**
 * @brief Initialize SNIC mode
 * @param seq sequence number
 */
void SnicInit(uint8_t seq)
{
  uint8_t buf[4];
  int32_t tmp;
  tmp = 0x00;     //The Default receive buffer size
  buf[0] = SNIC_INIT_REQ;
  buf[1] = seq;
  memcpy(buf+2, (uint8_t*)&tmp, 2);
  Serial_Transmit(CMD_ID_SNIC, buf, 4, ACK_NOT_REQUIRED);
  uprintf("-SnicInit\n\r");
}

/**
 * @brief SNIC cleanup function
 * @param seq sequence number
 */
void SnicCleanup(uint8_t seq)
{
    uint8_t buf[2];
    buf[0] = SNIC_CLEANUP_REQ;
    buf[1] = seq;
    Serial_Transmit(CMD_ID_SNIC, buf, 2, ACK_NOT_REQUIRED);
    uprintf("-SnicCleanup\n\r");
}

/**
 * @brief SNIC IP configuration function
 * @param seq sequence number for command
 */
void SnicIPConfig(uint8_t seq)
{
  uint8_t buf[16];
  buf[0] = SNIC_IP_CONFIG_REQ;
  buf[1] = seq;
  buf[2] = 0; //STA
  buf[3] = 1; //DHCP

  Serial_Transmit(CMD_ID_SNIC, buf, 4, ACK_NOT_REQUIRED);
  uprintf("-SnicIPConfig\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsSNICIPConfigResponsed)
    {
      IsSNICIPConfigResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
}

/**
 * @brief Get the DHCP value
 * @param seq sequence number
 */
void SnicGetDhcp(uint8_t seq)
{
  uint8_t buf[3];
  int8_t tempstr[2] = {0};

  buf[0] = SNIC_GET_DHCP_INFO_REQ;
  buf[1] = seq;
  uprintf("\n\rInterface Type? (0: STA  1: AP) \n\r");
  uget_line(tempstr,sizeof(tempstr));
//  scanf("%s", tempstr);
  uprintf("\n\r");
  buf[2] = atoi(tempstr);
  //buf[2] = 0; // STA  1; // AP
  Serial_Transmit(CMD_ID_SNIC, buf, 3, ACK_NOT_REQUIRED);
  uprintf("-SnicGetDhcp\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsSNICGetDHCPInfoResponsed)
    {
      IsSNICGetDHCPInfoResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
}

/**
 * @brief Creat socket for TCP
 * @param bindOption to present Local IP address and Local port
 * @param localIp IP address
 * @param port local port
 * @param seq sequence number
 * @param ssl SNIC command
 * @return value
 */
uint8_t TCPCreateSocket(uint8_t bindOption, uint32_t localIp, uint16_t port, uint8_t seq, uint8_t ssl)
{
  uint8_t buf[9];
  buf[0] = ssl;
  buf[1] = seq;
  buf[2] = bindOption;

