ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
  if (bindOption)
  {
    memcpy(buf+3, (uint8_t*)&localIp, 4);
    memcpy(buf+7, (uint8_t*)&port, 2);
    Serial_Transmit(CMD_ID_SNIC, buf, 9, ACK_NOT_REQUIRED);
  }
  else
  {
    Serial_Transmit(CMD_ID_SNIC, buf, 3, ACK_NOT_REQUIRED);
  }
  uprintf("-tcpCreateSocket\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsCreateSocketResponsed)
    {
      IsCreateSocketResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
  return 0;
}

/**
 * @brief close a socket
 * @param shortSocket socket number in both TCP and UDP
 * @param seq sequence number
 * @return value
 */
uint8_t CloseSocket(uint8_t shortSocket, uint8_t seq)
{
  uint8_t buf[3];
  buf[0] = SNIC_CLOSE_SOCKET_REQ;
  buf[1] = seq;
  buf[2] = shortSocket;
  Serial_Transmit(CMD_ID_SNIC, buf, 3, ACK_NOT_REQUIRED);
  uprintf("-closeSocket\n\r");
  uprintf("Socket %d02 closed\n\r", shortSocket);
  return 0;
}

/**
 * @brief connect to a remote TCP server
 * @param shortSock socket number in both TCP
 * @param ip  server IP address
 * @param port server port
 * @param bufsize maximum packet size the application wants to receive per transmission
 * @param timeout Time for connect attempt
 * @param seq sequence number
 * @return value
 */
uint8_t TCPConnectToServer(uint8_t shortSock, uint32_t ip, uint16_t port, uint16_t bufsize, uint8_t timeout, uint8_t seq)
{
  uint8_t buf[12];
  if (bufsize == 0 || bufsize > MAX_BUFFER_SIZE)
  {
    bufsize = MAX_BUFFER_SIZE;
  }
  buf[0] = SNIC_TCP_CONNECT_TO_SERVER_REQ;
  buf[1] = seq;
  buf[2] = shortSock;

  memcpy(buf+3, (uint8_t*)&ip, 4);
  memcpy(buf+7, (uint8_t*)&port, 2);
  bufsize = swap16(bufsize);
  memcpy(buf+9, (uint8_t*)&bufsize, 2);
  buf[11] = timeout;
  Serial_Transmit(CMD_ID_SNIC, buf, 12, ACK_NOT_REQUIRED);
  uprintf("-tcpConnectToServer\n\r");
  HAL_Delay(1000);        //Wait module return value
  while (1)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsSNICTCPConnectToServerResponsed)
    {
      IsSNICTCPConnectToServerResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
  return 0;
}

/**
 * @brief Create connection to a remote TCP server
 * @param shortSock socket number in both TCP
 * @param size maximum packet size the application wants to receive per transmission
 * @param maxClient maximum number of client connections this connection server can serve simultaneously
 * @param seq sequence number
 * @return value
 */
uint8_t TCPCreateConnection(uint8_t shortSock, uint16_t size, uint8_t maxClient, uint8_t seq)
{
  uint8_t buf[6];
  if (size == 0 || size > MAX_BUFFER_SIZE)
  {
    size = MAX_BUFFER_SIZE;
  }
  if (maxClient == 0 || maxClient > MAX_CONNECTION_PER_SOCK)
  {
    maxClient = MAX_CONNECTION_PER_SOCK;
  }
  buf[0] = SNIC_TCP_CREATE_CONNECTION_REQ;
  buf[1] = seq;
  buf[2] = shortSock;
  size = swap16(size);
  memcpy(buf+3, (uint8_t*)&size, 2);
  buf[5] = maxClient;
  Serial_Transmit(CMD_ID_SNIC, buf, 6, ACK_NOT_REQUIRED);
  uprintf("-tcpCreateConnection\n\r");
  return 0;
}

/**
 * @brief Send a packet to the remote peer via a connected socket
 * @param shortSocket socket number
 * @param sendBuf data to be sent
 * @param len data length
 * @param timeout time for send data attempt
 * @param seq sequence number
 * @return value
 */
uint8_t SendFromSock(uint8_t shortSocket, uint8_t * sendBuf, uint16_t len, uint8_t timeout, uint8_t seq)
{
  uint8_t buf[MAX_BUFFER_SIZE+6];
  uint16_t mybufsize;
  if (len == 0 || len > MAX_BUFFER_SIZE)
  {
    len = MAX_BUFFER_SIZE;
  }
  buf[0] = SNIC_SEND_FROM_SOCKET_REQ;
  buf[1] = seq;
  buf[2] = shortSocket;
  buf[3] = 0;
  mybufsize = swap16(len);
  memcpy(buf+4, (uint8_t*)&mybufsize, 2);
  memcpy(buf+6, sendBuf, len);
  Serial_Transmit(CMD_ID_SNIC, buf, 6+len, ACK_NOT_REQUIRED);
  uprintf("-sendFromSock\n\r");
  while (1)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsSNICSendFromSocketResponsed)
    {
      IsSNICSendFromSocketResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
  return 0;
}


/**
 * @brief Creat socket for UDP
 * @param bindOption to present Local IP address and Local port
 * @param ip IP address
 * @param port local port
 * @param seq sequence number
 * @return value
 */
uint8_t UDPCreateSocket(uint8_t bindOption, uint32_t ip, uint16_t port, uint8_t seq)
{
  uint8_t buf[9];
  buf[0] = SNIC_UDP_CREATE_SOCKET_REQ;
  buf[1] = seq;
  buf[2] = bindOption;
  if (bindOption)
  {
    uint32_t myip = swap32(ip);
    uint16_t myport = swap16(port);
    memcpy(buf+3, (uint8_t*)&myip, 4);
    memcpy(buf+7, (uint8_t*)&myport, 2);
    Serial_Transmit(CMD_ID_SNIC, buf, 9, ACK_NOT_REQUIRED);
  }
  else
  {
    Serial_Transmit(CMD_ID_SNIC, buf, 3, ACK_NOT_REQUIRED);
  }
  uprintf("-udpCreateSocket\n\r");
  while (1)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(IsCreateSocketResponsed)
    {
      IsCreateSocketResponsed = 0;
      break;
    }
    HAL_Delay(1);
  }
  return 0;
}

/**
 * @brief Send a packet to the remote peer
 * @param ip Remote IP address
 * @param iPort Remote port
 * @param shortsock Socket number
 * @param conMode Connection mode
 * @param sendbuf data to be sent
 * @param len data length
 * @param seq sequence number
 * @return value
 */
uint8_t UDPSendFromSock(uint32_t ip, uint16_t iPort, uint8_t shortsock, uint8_t conMode, uint8_t *sendbuf, uint16_t len, uint8_t seq)
{
  uint8_t buf[2048+12];
  uint16_t mybufsize;
  if (len == 0 || len > MAX_BUFFER_SIZE)
  {
    len = MAX_BUFFER_SIZE;
  }
  buf[0] = SNIC_UDP_SEND_FROM_SOCKET_REQ;
  buf[1] = seq;
  memcpy(buf+2, (uint8_t*)&ip, 4);
  memcpy(buf+6, (uint8_t*)&iPort, 2);
  buf[8] = shortsock;
  buf[9] = conMode;
  mybufsize = swap16(len);
  memcpy(buf+10, (uint8_t*)&mybufsize, 2);
  memcpy(buf+12, sendbuf, len);
  Serial_Transmit(CMD_ID_SNIC, buf, 12+len, ACK_NOT_REQUIRED);
  uprintf("-udpSendFromSock\n\r");
  timeout = 10000;
  while (timeout--)
  {
    if(SN8200_API_HasInput())
    {
      ProcessSN8200Input();
    }
    if(sendUDPDone)
    {
      sendUDPDone = 0;
      break;
    }
    HAL_Delay(1);
  }
  return 0;
}

/**
 * @brief Start receiving incoming data packets
 * @param sock Socket
 * @param bufsize data size
 * @param seq sequence number
 * @return
 */
uint8_t UDPStartRecv(uint32_t sock, uint16_t bufsize, uint8_t seq)
{
  uint8_t buf[5];
  int32_t tmp;
  if (bufsize == 0 || bufsize > MAX_BUFFER_SIZE)
  {
    bufsize = MAX_BUFFER_SIZE;
  }
  tmp = swap16(bufsize);
  buf[0] = SNIC_UDP_START_RECV_REQ;
  buf[1] = seq;
  buf[2] = sock;
  memcpy(buf+3, (uint8_t*)&tmp, 2);
  Serial_Transmit(CMD_ID_SNIC, buf, 5, ACK_NOT_REQUIRED);
  uprintf("-udpStartRecv\n\r");
  return 0;
}

/**
 * @brief process the received data
 */
void ProcessSN8200Input(void)
{
  RX_Thread_Proc();
}

/**
 * @brief Send a packet to the remote peer
 * @param buf data
 * @param size data size
 */
void SendSNIC(uint8_t *buf, int32_t size)
{
    const uint32_t IP = udpDestIP;
    uint16_t port = udpDestPort;
    sendUDPDone = 0;
    UDPSendFromSock(IP, port, mysock, 0, buf, size, seqNo++);
}

/**
 * @brief Send HTTP request
 * @param seq sequence number
 * @param domain domain name
 * @param uri to identify name of resource
 * @param method
 * @param contentType type of data
 * @param otherHeader
 * @param contentLen data length
 * @param content data
 * @param timeout time to send HTTP request
 * @param moreData
 * @param isHttps is https? 1 or 0
 * @return value
 */
uint8_t FillNSendHttpReq(uint8_t seq, int8_t* domain, int8_t* uri, int8_t method, int8_t* contentType, int8_t* otherHeader,
    int32_t contentLen, int8_t* content, uint8_t timeout, int8_t moreData, int8_t isHttps)
{
  int8_t *ptr = NULL;
  uint8_t buf[1024];
  uint16_t encodedLen = moreData?contentLen|0x8000:contentLen;
  memset(buf, 0, sizeof(buf));
  buf[0] = SNIC_HTTP_REQ;
  buf[1] = seq;
  *((uint16_t *)&buf[2]) = 0x5000; //swapped
  buf[4] = method;
  buf[5] = timeout;
  if (isHttps)
  {
    buf[0] = SNIC_HTTPS_REQ;
    *((uint16_t*)&buf[2]) = 0xbb01; // 443 swapped
  }
  ptr = (int8_t *)buf+6;
  ptr += sprintf(ptr, "%s", domain)+1;
  ptr += sprintf(ptr, "%s", uri)+1;
  ptr += sprintf(ptr, "%s", contentType)+1;
  ptr += sprintf(ptr, "%s", otherHeader)+1;
  *((uint16_t*)ptr) = swap16(encodedLen);
  ptr += 2;
  if (contentLen)
  {
    memcpy(ptr, content, contentLen);
  }
  Serial_Transmit(CMD_ID_SNIC, buf, ptr - (int8_t *)buf+contentLen, ACK_NOT_REQUIRED);
  return 0;
}

/**
 * @brief If moredata in the FillNSendHttpReq function is 1 then this function is
 *        used to send the request with the FillNSendHttpReq function
 * @param seq sequence number
 * @param contentLen data length
 * @param content data
 * @param moreData
 * @return value
 */
int8_t FillNSendHttpMoreReq(uint8_t seq, int32_t contentLen, int8_t* content, int8_t moreData)
{
  uint8_t buf[1024];
  uint16_t len = moreData?contentLen|0x8000:contentLen;
  buf[0] = SNIC_HTTP_MORE_REQ;
  buf[1] = seq;
  *((uint16_t*)&buf[2]) = swap16(len);
  if (contentLen+4 > sizeof(buf))
  {
    return -1;
  }
  memcpy(&buf[4], content, contentLen);
  Serial_Transmit(CMD_ID_SNIC, buf, contentLen+4, ACK_NOT_REQUIRED);
  return 0;
}

/**
 * @brief Print the menu
 */
void ShowMenu(void)
{
  uprintf("----------------------\n\r");
  uprintf("0 Get WiFi status\n\r");
  uprintf("1 Wifi Scan\n\r");
  uprintf("2 Wifi Join\n\r");
  uprintf("3 Get IP\n\r");
  uprintf("4 TCP client\n\r");
  uprintf("5 TCP sever\n\r");
  uprintf("6 Send from sock\n\r");
  uprintf("7 WiFi Leave\n\r");
  uprintf("8 AP On/Off\n\r");
  uprintf("9 UDP client\n\r");
  uprintf("a UDP server\n\r");
  uprintf("b Wifi Off\n\r");
  uprintf("c Wifi On\n\r");
//  uprintf("d HTTP get req\n\r");
//  uprintf("e HTTP post req\n\r");
//  uprintf("f HTTP post Json req\n\r");
//  uprintf("g HTTP chunked post req\n\r");
//  uprintf("h HTTPS get req\n\r");
//  uprintf("i TLS client\n\r");
//  uprintf("j TLS server (HTTPS server)\n\r");
  uprintf("m: Show Menu\n\r");
  uprintf("q: press q to Quit \n\r");
  uprintf("-----------------------\n\r");
}

/**
 * @brief Send http request function
 * @param domain domain name
 * @param isHttps https or not
 * @return value
 */
int8_t SendHttpReqTest(int8_t *domain, int8_t isHttps)
{
  int8_t tmp[100] = {0};
  int8_t method = 0; //GET
  int8_t contentType[] = "text/html";
  int8_t otherHeader[] = "";
  int8_t content[] = "";
  uint8_t timeout = 10;
  uprintf("Enter URI after the server name: ([CR] to accept %s)\n\r", uri);
//  uget_line(tmp, sizeof(tmp));
  uint8_t data,i;
  i = 0;
  while(1)
  {
    if(HAL_UART_Receive(&huart6,&data,1,50000) == HAL_OK)
    {
      if(data == In_CR)
      {
        break;
      }
      tmp[i] = data;
      i++;
      HAL_UART_Transmit(&huart6,&data,1,1000);
    }
  }
//  scanf("%s",tmp);
  uprintf("\n\r");

  if (strlen(tmp))
  {
    strcpy(uri, tmp);
  }
  return FillNSendHttpReq(seqNo++, domain, uri, method, contentType, otherHeader, strlen(content), content, timeout, 0, isHttps);
}

/**
 * @brief Send http post demo function
 * @param domain domain name
 * @return value
 */
int32_t SendHttpPostDemo(int8_t *domain)
{
  int8_t content[256]={0};
  int8_t tmp[100];
  int8_t method = 1; //POST
  int8_t contentType[] = "text/html";
  int8_t otherHeader[] = "Accept-Language: en-US\r\n";
  uint8_t timeout = 10;

  uprintf("Enter URI after the server name: ([CR] to accept %s)\n\r", uri);
  uget_line(tmp, sizeof(tmp));
//  scanf("%s",tmp);
  uprintf("\n\r");
  if (strlen(tmp))
  {
    strcpy(uri, tmp);
  }
  uprintf("Enter content to POST: \n\r");
//  uget_line(content, sizeof(content));
  uint8_t data,i;
  i = 0;
  while(1)
  {
    if(HAL_UART_Receive(&huart6,&data,1,50000) == HAL_OK)
    {
      if(data == In_CR)
      {
        break;
      }
      content[i] = data;
      i++;
      HAL_UART_Transmit(&huart6,&data,1,1000);
    }
  }
//  scanf("%s",content);
  uprintf("\n\r");
  if (strlen(uri)==0)
  {
    strcpy(uri, "/add.php");
  }
  return FillNSendHttpReq(seqNo++, domain, uri, method, contentType, otherHeader, strlen(content), content, timeout, 0,0);
}

/**
 * @brief Send http JSON post demo function
 * @param domain domain name
 * @return value
 */
int32_t SendHttpJsonPostDemo(int8_t *domain)
{
  int8_t content[]="Params=%7B%22if%22%3A%22sta%22%7D&callback=jsonp1363359950547";
  int8_t tmp[100];

  int8_t method = 1; //POST
  int8_t contentType[] = "application/x-www-form-urlencoded";
  int8_t otherHeader[] = "Accept-Language: en-US\r\n";
  uint8_t timeout = 10;

  strcpy(uri, "/sws/wifi/stat");
  uprintf("Enter URI after the server name: ([CR] to accept %s)\n\r", uri);
  uget_line(tmp, sizeof(tmp));
//  scanf("%s",tmp);
  uprintf("\n\r");
  if (strlen(tmp))
  {
    strcpy(uri, tmp);
  }
  uprintf("Enter content to POST: ([CR] to accept %s)\n\r", content);
  uget_line(tmp, sizeof(tmp));
//  scanf("%s",tmp);
  uprintf("\n\r");
  if (strlen(tmp))
  {
    strcpy(content, tmp);
  }
  return FillNSendHttpReq(seqNo++, domain, uri, method, contentType, otherHeader, strlen(content), content, timeout, 0,0);
}

/**
 * @brief Send http chunk request test function
 * @param domain domain name
 * @return value
 */
int32_t SendHttpChunkReqTest(int8_t *domain)
{
  int8_t uri[] = "/rest/thermostatGetTime";
  int8_t method = 1; //POST
  int8_t contentType[] = "application/x-www-form-urlencoded";
  int8_t otherHeader[] = "Accept: text/html,application/xml\r\nAccept-Language: en-US\r\n";
  int8_t content[] = "mcu_serial_number_hex=00112233445566778899AA";
  int8_t content1[] = "&username=MyUsername&password=MyPassword";
  uint8_t timeout = 20;
  int16_t len = strlen(content); // more data

  // first chunk
  FillNSendHttpReq(seqNo++, domain, uri, method, contentType, otherHeader, len, content, timeout, 1, 0);
  HAL_Delay(1000);
  //second chunk
  FillNSendHttpMoreReq(seqNo++, strlen(content1), content1, 0);
  return 0;
}

/**
 * @brief Process user input data function
 */
void ProcessUserInput(void)
{
  int8_t tmp[100];
  DBGU_InputReady = 0;

  uprintf("\n\r");

  if (key == 'q')
      quit_flag = 1;

  switch(key)
  {
    case '0':
      GetStatus(seqNo++);
      break;

    case '1':
      WifiScan(seqNo++);
      break;

    case '2':
      WifiDisconn(seqNo++);
      WifiJoin(seqNo++);
      SnicInit(seqNo++);
      SnicIPConfig(seqNo++);
      break;

