ELSPL/STM32F4-Dev/Project_Templates/stm32f4_bsp_template/Drivers/BSP/stm32f4_discovery_wifi.c
    case '3':
      SnicInit(seqNo++);
      SnicGetDhcp(seqNo++);
      break;

    case '4':
      mysock = -1;
      TCPCreateSocket(0, 0xFF, 0xFF, seqNo++, SNIC_TCP_CREATE_SOCKET_REQ);
      if (mysock != -1)
      {
        if (GetTCPInfo() == CMD_ERROR)
        {
          uprintf("Invalid Server\n\r");
          break;
        }
        // This connection can receive data upto 0x0400=1K bytes at a time.
        TCPConnectToServer(mysock, destIP, (uint16_t)destPort, 0x0400, 0x5, seqNo++);
      }
      break;

    case '5':
      if (SetTCPInfo() == CMD_ERROR)
      {
        uprintf("Invalid Server to create\n\r");
        break;
      }
      mysock = -1;
      TCPCreateSocket(1, srcIP, (uint16_t)srcPort, seqNo++, SNIC_TCP_CREATE_SOCKET_REQ);
      if (mysock != -1)
      {
        // This connection can receive data upto TEST_BUFFERSIZE at a time.
        TCPCreateConnection(mysock, TEST_BUFFERSIZE, 0x5, seqNo++);
      }
      break;

    case '6':
    {
      int8_t tempstr[3];
      uint8_t datamode;
      int8_t sockstr[8] = {0};
      uint32_t sock;
      int8_t teststr[128];
      int32_t len;

      uprintf("Enter socket number to send from: \n\r");
      uget_line(sockstr,sizeof(sockstr));
      uprintf("\n\r");
//      scanf("%s", sockstr);
      sock = strtol(sockstr, NULL, 0);
      uprintf("Content Option? (0: Default 128bytes will be sent) \n\r");
      uget_line(tempstr,sizeof(tempstr));
      uprintf("\n\r");
//      scanf("%s", tempstr);
//      datamode = strtol(tempstr);
//      if (datamode)
//      {
//        uprintf("Enter payload to send (up to 128 bytes): \n\r");
//        uget_line(tempstr,sizeof(tempstr));
//        uprintf("\n\r");
//        scanf("%s", teststr);
//        len = (int32_t)strlen(teststr);
//        SendFromSock(sock, (uint8_t*)teststr, len, 2, seqNo++);
//      }
//      else

     SendFromSock(sock, TxBuf, TEST_BUFFERSIZE, 2, seqNo++);
     pktcnt = 0;

      break;
    }
    case '7':
      SnicCleanup(seqNo++);
      WifiDisconn(seqNo++);
      break;

    case '8':
      ApOnOff(seqNo++);
      break;

    case '9': //udp send
    {
      int32_t i;
      UDPCreateSocket(0, 0, 0, seqNo++);
      if (mysock != -1)
      {
        if (GetUDPInfo() == CMD_ERROR)
        {
          uprintf("Invalid Server\n\r");
          break;
        }
        uprintf("Send %d02\n\r", UDP_NUM_PKT);
        for (i=0; i<UDP_NUM_PKT; i++)
        {
          int32_t si = i % TEST_BUFFERSIZE + 1;
          SendSNIC(TxBuf, si);
          uprintf("%d02 %d02\n\r", i, si);
        }
        CloseSocket(mysock,seqNo++);
      }
      break;
    }
    case 'a': //udp recv
    {
      uint16_t port = 43211;
      uint32_t ip = 0xAC1F0001; // 172.31.0.1
      UDPCreateSocket(1, ip, port, seqNo++);
      UDPStartRecv(mysock, 2048, seqNo++);
      break;
    }
    case 'b':
      SnicCleanup(seqNo++);
      WifiOff(seqNo++);
      break;

    case 'c':
      WifiOn(seqNo++);
      break;

//    case 'd':
//      uprintf("Enter server name:  %s\n\r", domain);
//      uget_line(tmp, sizeof(tmp));
////      scanf("%s", tmp);
//      uprintf("\n\r");
//      if (strlen(tmp))
//      {
//        strcpy(domain, tmp);
//      }
//      SendHttpReqTest(domain, 0);
//      break;
//
//    case'e':
//      uprintf("Enter server name: ([CR] to accept %s)\n\r", domain);
//      uget_line(tmp, sizeof(tmp));
////      scanf("%s", tmp);
//      uprintf("\n\r");
//      if (strlen(tmp))
//      {
//        strcpy(domain, tmp);
//      }
//      SendHttpPostDemo(domain);
//      break;
//
//    case 'f':
//      uprintf("Make sure STA is connected to SN8200 soft AP.\n\r");
//      strcpy(domain, "sn8200.com");
//      uprintf("Enter server name: ([CR] to accept %s)\n\r", domain);
//      uget_line(tmp, sizeof(tmp));
////      scanf("%s", tmp);
//      uprintf("\n\r");
//      if (strlen(tmp))
//      {
//        strcpy(domain, tmp);
//      }
//      SendHttpJsonPostDemo(domain);
//      break;
//#if 1
//    case 'g':
//      strcpy(domain, "192.168.10.100");
//      uprintf("Enter server name (or the peer testclient IP, peer testclient should start TCP server on port 80): ([CR] to accept %s)\n\r", domain);
//      uget_line(tmp, sizeof(tmp));
////      scanf("%s", tmp);
//      uprintf("\n\r");
//      if (strlen(tmp))
//      {
//        strcpy(domain, tmp);
//      }
//      SendHttpChunkReqTest(domain);
//      break;
//#endif
//
//    case 'h':
//      uprintf("Enter server name: ([CR] to accept %s)\n\r", domain);
//      uget_line(tmp, sizeof(tmp));
////      scanf("%s", tmp);
//      uprintf("\n\r");
//      if (strlen(tmp))
//      {
//        strcpy(domain, tmp);
//      }
//      SendHttpReqTest(domain, 1);
//      break;
//
//    case 'i':
//      timeout1 = 5;
//      mysock = -1;
//      TCPCreateSocket(0, 0xFF, 0xFF, seqNo++, SNIC_TCP_CREATE_SIMPLE_TLS_SOCKET_REQ);  // use less memory in SN8200
//      HAL_Delay(500);
//      if (mysock != -1)
//      {
//        strcpy(Portstr, "443");
//        if (GetTCPInfo() == CMD_ERROR)
//        {
//          uprintf("Invalid Server\n\r");
//          break;
//        }
//        TCPConnectToServer(mysock, destIP, (unsigned short)destPort,0x0000,timeout1,seqNo++);
//        while ((sockConnected == -1) && timeout1)
//        {
//          HAL_Delay(500);
//          timeout1--;
//          if (sockClosed == mysock)
//          {
//            sockClosed = -1;
//            break;
//          }
//        }
//        if (sockConnected == mysock)
//        {
//          SendFromSock(mysock, (uint8_t*)GET_REQUEST, sizeof(GET_REQUEST)-1, 2, seqNo++);
//          sockConnected = -1;
//        }
//        else
//          {
//            uprintf("Connect failed.\n\r");
//          }
//      }
//      break;
//
//    case 'j': //ssl server
//      strcpy(Portstr, "443");
//      if (SetTCPInfo() == CMD_ERROR)
//      {
//        uprintf("Invalid Server to create\n\r");
//        break;
//      }
//      mysock = -1;
//      TCPCreateSocket(1, srcIP, (uint16_t)srcPort, seqNo++, SNIC_TCP_CREATE_ADV_TLS_SOCKET_REQ);
//      if (mysock != -1)
//      {
//        // This connection can receive data upto TEST_BUFFERSIZE at a time.
//        TCPCreateConnection(mysock, TEST_BUFFERSIZE, 0x5, seqNo++);
//      }
//      break;

    case 'm':
      ShowMenu();
      break;

    default:
      break;
  }
}
/**
 * @} STM32F4_DISCOVERY_WIFI_Public_Functions End
 */

/**
 * @} STM32F4_DISCOVERY_WIFI End
 */

 /* --------------------------------- End Of File ------------------------------ */
